# GetFileSize

```pascal
FUNCTION GetFileSize(VAR FilePath : STRING): LONGINT;
```

```python
def vs.GetFileSize(FilePath):
    return (LONGINT, FilePath)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|FilePath|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* File I@O